we learn to handel missing values
detect missing values
remove duplicate values

In [ ]:
import pandas as pd
import numpy as np

#create a messy dataset
data = {'Name': ['John', 'Jane', 'Mike', 'Emily', 'David'],
        'Age': [25,np.nan,30,35,np.nan],
        'Salary': [50000,60000,70000,np.nan,80000]}
df = pd.DataFrame(data)
print("original dataframe")
print(df)

original dataframe
    Name   Age   Salary
0   John  25.0  50000.0
1   Jane   NaN  60000.0
2   Mike  30.0  70000.0
3  Emily  35.0      NaN
4  David   NaN  80000.0

In [ ]:
#find missing values
print("missing values")
print(df.isnull().sum())

missing values
Name      0
Age       2
Salary    1
dtype: int64

In [ ]:
#remove row with missing valuese
df_clean = df.dropna()
print("cleaned dataframe after dropping missing values")
print(df_clean)

cleaned dataframe after dropping missing values
   Name   Age   Salary
0  John  25.0  50000.0
2  Mike  30.0  70000.0

In [ ]:
#filling missing values
df_filled = df.fillna({
    'Age': df['Age'].mean(),
    'Salary': df['Salary'].median()
})
print("dataframe after filling missing values")
print(df_filled)

dataframe after filling missing values
    Name   Age   Salary
0   John  25.0  50000.0
1   Jane  30.0  60000.0
2   Mike  30.0  70000.0
3  Emily  35.0  65000.0
4  David  30.0  80000.0

In [ ]:
#remove duplicate rows
df_nodup = df_filled.drop_duplicates()
print("dataframe after removing duplicates")
print(df_nodup)

dataframe after removing duplicates
    Name   Age   Salary
0   John  25.0  50000.0
1   Jane  30.0  60000.0
2   Mike  30.0  70000.0
3  Emily  35.0  65000.0
4  David  30.0  80000.0